In [2]:
import pandas as pd
from clean_data_functions import cleanse_data

marsons_df = pd.read_csv('pub_data_result.csv')
marsons_df.columns =['pub_name', 'address', 'category', 'item_name', 'item_price', 'opening_times']
cleanse_data(marsons_df)
marsons_df.head(5)

,pub_name,address,category,item_name,item_price,opening_times
0,Blue Jay Derby,"Derby, DE21 7HX",Starters & Sharers,Soup of the Day (Ve),£4.70,07:00 - 23:00
1,Blue Jay Derby,"Derby, DE21 7HX",Starters & Sharers,Crispy Buttermilk Chicken Goujons for One,£5.60,07:00 - 23:00
2,Blue Jay Derby,"Derby, DE21 7HX",Starters & Sharers,Brie Dippers for One (V)*,£5.60,07:00 - 23:00
3,Blue Jay Derby,"Derby, DE21 7HX",Starters & Sharers,Mexican Nachos for One (V),£5.60,07:00 - 23:00
4,Blue Jay Derby,"Derby, DE21 7HX",Starters & Sharers,Mexican Nachos for One (Ve),£5.60,07:00 - 23:00

In [3]:
marsons_df.describe()

,pub_name,address,category,item_name,item_price,opening_times
count,101826,101220,101526,101526,101526,100250
unique,477,478,91,2133,339,21
top,Riddle & Rye Exeter,"Exeter, EX4 3LR",Spirits,Blackcurrant Cordial - 14oz,£4.95,09:00 - 23:00
freq,1036,1036,24822,318,2096,42060

In [6]:
marsons_df = marsons_df.dropna()
marsons_df.describe()

,pub_name,address,category,item_name,item_price,opening_times
count,96362,96362,96362,96362,96362,96362
unique,178,178,91,2132,339,21
top,Riddle & Rye Exeter,"Exeter, EX4 3LR",Spirits,Ice Cream Sundae (Ve),£4.95,09:00 - 23:00
freq,1032,1032,22943,293,2045,40849

In [11]:
marsons_df['category'] = marsons_df['category'].astype('category')
marsons_df['category'].describe() # still object?

count        96362
unique          91
top        Spirits
freq         22943
Name: category, dtype: object

In [13]:
clean_price = price.replace(to_replace='[^0-9.]', value='', regex=True)
float_column = pd.to_numeric(clean_price)

NameError: name 'price' is not defined